examples/xml-only-soap-webservice/XMLonlySOAPservice/src/main/synapse-config/sequences/getPatient.xml

<?xml version="1.0" encoding="UTF-8"?>
<sequence name="getPatient" trace="disable" xmlns="http://ws.apache.org/ns/synapse">
    <payloadFactory description="set getPatient query" media-type="xml">
        <format>
            <soapenv:Envelope xmlns:ns0="http://wso2.org/hospital-admission-service" xmlns:ns1="http://wso2.org/hospital-admission-service/modal" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
                <soapenv:Header/>
                <soapenv:Body>
                    <ns0:getPatient>
                        <ns1:PatientId>$1</ns1:PatientId>
                    </ns0:getPatient>
                </soapenv:Body>
            </soapenv:Envelope>
        </format>
        <args>
            <arg evaluator="xml" expression="get-property('SYSTEM_DATE')"/>
        </args>
    </payloadFactory>
    <header description="SOAPHeader" name="Action" scope="default" value="http://wso2.org/hospital-admission-service/patient/getPatient"/>
    <header description="Content-Type" name="Content-Type" scope="transport" value="text/xml"/>
    <call description="Invoke Patient Service">
        <endpoint key="PatientServiceEndpoint"/>
    </call>
</sequence>
